[
    {"word": "python", "hint": "A popular programming language named after a type of snake."},
    {"word": "javascript", "hint": "A programming language commonly used in web development."},
    {"word": "java", "hint": "A versatile programming language that runs on the Java Virtual Machine."},
    {"word": "kotlin", "hint": "A modern programming language that is fully interoperable with Java."},
    {"word": "swift", "hint": "A programming language developed by Apple for iOS and macOS development."},
    {"word": "golang", "hint": "A programming language designed at Google known for its efficiency."},
    {"word": "apple", "hint": "A popular fruit that is often red, green, or yellow."},
    {"word": "ocean", "hint": "A large body of salt water that covers much of the Earth."},
    {"word": "mountain", "hint": "A large landform that rises prominently above its surroundings."},
    {"word": "giraffe", "hint": "A tall animal known for its long neck and spotted coat."},
    {"word": "computer", "hint": "An electronic device for storing and processing data."},
    {"word": "book", "hint": "A set of written or printed pages bound together."},
    {"word": "music", "hint": "Art form consisting of sound and silence expressed through time."},
    {"word": "river", "hint": "A flowing body of water that usually empties into an ocean or lake."},
    {"word": "chocolate", "hint": "A sweet food made from roasted and ground cacao seeds."},
    {"word": "star", "hint": "A luminous celestial body visible in the night sky."},
    {"word": "pyramid", "hint": "A structure with a square base and triangular sides that meet at a point."},
    {"word": "city", "hint": "A large human settlement with a complex system of governance."},
    {"word": "garden", "hint": "A space where plants are cultivated, often for food or beauty."},
    {"word": "sunflower", "hint": "A tall plant with a large yellow flower that follows the sun."},
    {"word": "diamond", "hint": "A precious stone known for its brilliance and hardness."},
    {"word": "cloud", "hint": "A visible mass of condensed water vapor floating in the atmosphere."},
    {"word": "whale", "hint": "A large marine mammal known for its size and intelligence."},
    {"word": "balloon", "hint": "A flexible bag filled with gas, often used for decoration or entertainment."},
    {"word": "theater", "hint": "A place where plays, movies, or performances are presented."},
    {"word": "horizon", "hint": "The line where the earth's surface and the sky appear to meet."},
    {"word": "elephant", "hint": "The largest land animal known for its intelligence and strong social bonds."},
    {"word": "beach", "hint": "A sandy shore by a body of water."},
    {"word": "volcano", "hint": "A geological formation where magma erupts from the Earth's crust."},
    {"word": "sunset", "hint": "The time of day when the sun disappears below the horizon."},
    {"word": "library", "hint": "A place where books and other resources are stored for public use."},
    {"word": "space", "hint": "The vast, seemingly infinite expanse that exists beyond Earth's atmosphere."},
    {"word": "bridge", "hint": "A structure built to span a physical obstacle such as a river or road."},
    {"word": "train", "hint": "A mode of transportation consisting of a series of connected cars that run on tracks."},
    {"word": "cake", "hint": "A sweet baked dessert often enjoyed on special occasions."},
    {"word": "desert", "hint": "A barren, sandy region with very little precipitation."},
    {"word": "forest", "hint": "A large area covered chiefly with trees and undergrowth."},
    {"word": "fountain", "hint": "A decorative feature that sends water into the air, often found in parks or gardens."},
    {"word": "rocket", "hint": "A vehicle or device propelled by the expulsion of gas, used for space travel."},
    {"word": "museum", "hint": "An institution that collects, conserves, and displays artifacts for public education."},
    {"word": "jungle", "hint": "A dense, tropical forest with a high level of biodiversity."},
    {"word": "monument", "hint": "A structure built to commemorate a person, event, or significant achievement."},
    {"word": "island", "hint": "A piece of land completely surrounded by water."},
    {"word": "planet", "hint": "A celestial body orbiting a star, such as Earth or Mars."},
    {"word": "sculpture", "hint": "A three-dimensional work of art created by shaping materials like stone or metal."},
    {"word": "festival", "hint": "A series of events or performances celebrating a particular theme or occasion."},
    {"word": "glacier", "hint": "A large, slow-moving mass of ice formed from compacted snow."},
    {"word": "apple", "hint": "A fruit that keeps the doctor away"},
    {"word": "ball", "hint": "A round object used in games"},
    {"word": "cat", "hint": "A common household pet with whiskers"},
    {"word": "dog", "hint": "A loyal companion often called man's best friend"},
    {"word": "elephant", "hint": "A large animal with a trunk"},
    {"word": "fish", "hint": "An aquatic animal often found in the ocean"},
    {"word": "guitar", "hint": "A stringed musical instrument"},
    {"word": "house", "hint": "A place where people live"},
    {"word": "ice", "hint": "Frozen water"},
    {"word": "juice", "hint": "A drink made from fruit"},
    {"word": "kite", "hint": "A flying object often flown on windy days"},
    {"word": "lemon", "hint": "A yellow, tangy fruit"},
    {"word": "moon", "hint": "The natural satellite of Earth"},
    {"word": "nest", "hint": "A home built by birds"},
    {"word": "orange", "hint": "A fruit that is also a color"},
    {"word": "pencil", "hint": "A tool used for writing or drawing"},
    {"word": "queen", "hint": "A female ruler in a monarchy"},
    {"word": "rose", "hint": "A type of flower often associated with romance"},
    {"word": "sun", "hint": "The star at the center of our solar system"},
    {"word": "tree", "hint": "A tall plant with a trunk and branches"},
    {"word": "umbrella", "hint": "An object used to protect from rain"},
    {"word": "vase", "hint": "A container used for holding flowers"},
    {"word": "water", "hint": "A clear, essential liquid for life"},
    {"word": "xylophone", "hint": "A musical instrument with wooden bars"},
    {"word": "yarn", "hint": "A long, thin strand used for knitting"},
    {"word": "zebra", "hint": "An animal with black and white stripes"},
    {"word": "airplane", "hint": "A vehicle that flies through the sky"},
    {"word": "bridge", "hint": "A structure used to cross over something"},
    {"word": "cake", "hint": "A sweet baked dessert often eaten at celebrations"},
    {"word": "door", "hint": "An object used to enter or exit a room"},
    {"word": "engine", "hint": "A machine that powers vehicles"},
    {"word": "fork", "hint": "A utensil with three or four prongs used for eating"},
    {"word": "giraffe", "hint": "A tall animal with a long neck"},
    {"word": "hat", "hint": "A headwear often worn for fashion or protection"},
    {"word": "island", "hint": "A landmass surrounded by water"},
    {"word": "jacket", "hint": "A piece of clothing worn on the upper body"},
    {"word": "key", "hint": "An object used to unlock doors"},
    {"word": "lamp", "hint": "An object used to provide light"},
    {"word": "map", "hint": "A representation of geographical areas"},
    {"word": "notebook", "hint": "A book used for writing notes"},
    {"word": "ocean", "hint": "A vast body of saltwater covering most of Earth"},
    {"word": "penguin", "hint": "A flightless bird that lives in the southern hemisphere"},
    {"word": "quilt", "hint": "A warm cover made of patches of fabric"},
    {"word": "robot", "hint": "A machine capable of carrying out complex tasks"},
    {"word": "shoe", "hint": "A covering for the foot"},
    {"word": "train", "hint": "A vehicle that moves along tracks"},
    {"word": "violin", "hint": "A stringed instrument played with a bow"},
    {"word": "window", "hint": "An opening in a wall covered with glass"},
    {"word": "xylophone", "hint": "A musical instrument with wooden bars struck by mallets"},
    {"word": "yogurt", "hint": "A dairy product made by fermenting milk"},
    {"word": "zoo", "hint": "A place where animals are kept for public viewing"},
    {"word": "absolutely", "hint": "Without any doubt"},
    {"word": "beneficial", "hint": "Providing a positive effect or advantage"},
    {"word": "circumference", "hint": "The distance around a circle"},
    {"word": "discovery", "hint": "The act of finding something for the first time"},
    {"word": "encyclopedia", "hint": "A comprehensive reference work containing articles on a wide range of subjects"},
    {"word": "facilitate", "hint": "To make an action or process easier"},
    {"word": "generosity", "hint": "The quality of being kind and giving"},
    {"word": "hypothesis", "hint": "A proposed explanation based on limited evidence"},
    {"word": "imagination", "hint": "The ability to form new ideas or images not present to the senses"},
    {"word": "judicious", "hint": "Having or showing good judgment"},
    {"word": "knowledgeable", "hint": "Possessing a lot of knowledge or information"},
    {"word": "linguistics", "hint": "The scientific study of language and its structure"},
    {"word": "mathematical", "hint": "Relating to mathematics or its principles"},
    {"word": "narrative", "hint": "A spoken or written account of connected events"},
    {"word": "observation", "hint": "The action of closely monitoring something"},
    {"word": "participation", "hint": "The action of taking part in something"},
    {"word": "quintessential", "hint": "Representing the most perfect or typical example of something"},
    {"word": "reliable", "hint": "Consistently good in quality or performance"},
    {"word": "significant", "hint": "Sufficiently great or important to be worthy of attention"},
    {"word": "transformation", "hint": "A thorough or dramatic change in form or appearance"},
    {"word": "unpredictable", "hint": "Not able to be predicted or foreseen"},
    {"word": "vegetarian", "hint": "A person who does not eat meat"},
    {"word": "wavelength", "hint": "The distance between successive peaks of a wave"},
    {"word": "xenophobia", "hint": "Intense or irrational dislike or fear of people from other countries"},
    {"word": "youthful", "hint": "Having the characteristics of young people"},
    {"word": "zealous", "hint": "Having or showing great enthusiasm in pursuit of a cause"},
    {"word": "abominable", "hint": "Very unpleasant or horrible"},
    {"word": "ballistic", "hint": "Relating to the flight of projectiles"},
    {"word": "complicated", "hint": "Consisting of many interconnecting parts or elements"},
    {"word": "demonstration", "hint": "The action of showing how something works or is done"},
    {"word": "exaggeration", "hint": "A statement that represents something as better or worse than it really is"},
    {"word": "fabrication", "hint": "The action or process of inventing or manufacturing something"},
    {"word": "glorious", "hint": "Having great beauty or splendor"},
    {"word": "hilarious", "hint": "Extremely funny and causing laughter"},
    {"word": "infrastructure", "hint": "The basic physical and organizational structures needed for the operation of a society"},
    {"word": "juxtaposition", "hint": "The fact of two things being seen or placed close together with contrasting effect"},
    {"word": "knowledgeable", "hint": "Possessing a lot of knowledge or information"},
    {"word": "luminescence", "hint": "The emission of light by a substance not resulting from heat"},
    {"word": "metamorphosis", "hint": "A transformation or change in form"},
    {"word": "negligible", "hint": "So small or unimportant as to be not worth considering"},
    {"word": "optimization", "hint": "The action of making the best or most effective use of a situation or resource"},
    {"word": "philosophy", "hint": "The study of the fundamental nature of knowledge, reality, and existence"},
    {"word": "quarantine", "hint": "A period of isolation to prevent the spread of disease"},
    {"word": "rejuvenation", "hint": "The action or process of making something look or feel younger or fresher"},
    {"word": "stimulation", "hint": "The action of arousing interest or enthusiasm"},
    {"word": "thermodynamic", "hint": "Relating to the branch of physics concerned with heat and temperature"},
    {"word": "unveiling", "hint": "The act of making something visible or known"},
    {"word": "verifiable", "hint": "Able to be checked or confirmed as true"},
    {"word": "withdrawal", "hint": "The action of withdrawing or taking back something"},
    {"word": "xenon", "hint": "A chemical element used in lighting and as a general anesthetic"},
    {"word": "yawning", "hint": "Involuntary opening of the mouth wide, often due to tiredness"},
    {"word": "zoologist", "hint": "A scientist who studies animals and their behavior"}
]
